from dao.model.movie import Movie
from dao.model.genre import Genre
from dao.model.director import Director
from setup_db import db


movies = [{
    "description": "Владелец ранчо пытается сохранить землю своих предков. Кевин Костнер в неовестерне от автора «Ветреной реки»",
    "year": 2018,
    "id": 1,
    "title": "Йеллоустоун",
    "genre_id": 17,
    "director_id": 1,
    "trailer": "https://www.youtube.com/watch?v=UKei_d0cbP4",
    "rating": 8.6
  },
  {
    "description": "США после Гражданской войны. Легендарный охотник за головами Джон Рут по кличке Вешатель конвоирует заключенную. По пути к ним прибиваются еще несколько путешественников. Снежная буря вынуждает компанию искать укрытие в лавке на отшибе, где уже расположилось весьма пестрое общество: генерал конфедератов, мексиканец, ковбой… И один из них - не тот, за кого себя выдает.",
    "year": 2015,
    "id": 2,
    "title": "Омерзительная восьмерка",
    "genre_id": 4,
    "director_id": 2,
    "trailer": "https://www.youtube.com/watch?v=lmB9VWm0okU",
    "rating": 7.8
  },
  {
    "description": "События происходят в конце XIX века на Диком Западе, в Америке. В основе сюжета — сложные перипетии жизни работяги — старателя Габриэля Конроя. Найдя нефть на своем участке, он познает и счастье, и разочарование, и опасность, и отчаяние...",
    "year": 1978,
    "id": 3,
    "title": "Вооружен и очень опасен",
    "genre_id": 17,
    "director_id": 3,
    "trailer": "https://www.youtube.com/watch?v=hLA5631F-jo",
    "rating": 6
  },
  {
    "description": "Эксцентричный охотник за головами, также известный как Дантист, промышляет отстрелом самых опасных преступников. Работенка пыльная, и без надежного помощника ему не обойтись. Но как найти такого и желательно не очень дорогого? Освобождённый им раб по имени Джанго – прекрасная кандидатура. Правда, у нового помощника свои мотивы – кое с чем надо сперва разобраться.",
    "year": 2012,
    "id": 4,
    "title": "Джанго освобожденный",
    "genre_id": 17,
    "director_id": 2,
    "trailer": "https://www.youtube.com/watch?v=2Dty-zwcPv4",
    "rating": 8.4
  },
  {
    "description": "История превращения застенчивого парня Реджинальда Дуайта, талантливого музыканта из маленького городка, в суперзвезду и культовую фигуру мировой поп-музыки Элтона Джона.",
    "year": 2019,
    "id": 5,
    "title": "Рокетмен",
    "genre_id": 18,
    "director_id": 4,
    "trailer": "https://youtu.be/VISiqVeKTq8",
    "rating": 7.3
  },
  {
    "description": "Али - молодая амбициозная девушка из маленького городка с чудесным голосом, совсем недавно потеряла своих родителей. Теперь никому не нужная, она отправляется в большой город Лос-Анджелес, где устраивается на работу у Тесс, хозяйки ночного клуба «Бурлеск». За короткое время она находит друзей, поклонников и любовь всей своей жизни. Но может ли сказка длиться вечно? Ведь немало людей завидует этой прекрасной танцовщице...",
    "year": 2010,
    "id": 6,
    "title": "Бурлеск",
    "genre_id": 18,
    "director_id": 5,
    "trailer": "https://www.youtube.com/watch?v=sgOhxneHkiE",
    "rating": 6.4
  },
  {
    "description": "Рокси Харт мечтает о песнях и танцах и о том, как сравняться с самой Велмой Келли, примадонной водевиля. И Рокси действительно оказывается с Велмой в одном положении, когда несколько очень неправильных шагов приводят обеих на скамью подсудимых.",
    "year": 2002,
    "id": 7,
    "title": "Чикаго",
    "genre_id": 18,
    "director_id": 6,
    "trailer": "https://www.youtube.com/watch?v=YxzS_LzWdG8",
    "rating": 7.2
  },
  {
    "description": "Париж, 1899 год. Знаменитый ночной клуб «Мулен Руж» — это не только дискотека и шикарный бордель, но и место, где, повинуясь неудержимому желанию прочувствовать атмосферу праздника, собираются страждущие приобщиться к красоте, свободе, любви и готовые платить за это наличными.",
    "year": 2001,
    "id": 8,
    "title": "Мулен Руж",
    "genre_id": 18,
    "director_id": 7,
    "trailer": "https://www.youtube.com/watch?v=lpiMCTd87gE",
    "rating": 7.6
  },
  {
    "description": "Эндрю мечтает стать великим. Казалось бы, вот-вот его мечта осуществится. Юношу замечает настоящий гений, дирижер лучшего в стране оркестра. Желание Эндрю добиться успеха быстро становится одержимостью, а безжалостный наставник продолжает подталкивать его все дальше и дальше – за пределы человеческих возможностей. Кто выйдет победителем из этой схватки?",
    "year": 2013,
    "id": 9,
    "title": "Одержимость",
    "genre_id": 4,
    "director_id": 8,
    "trailer": "https://www.youtube.com/watch?v=Q9PxDPOo1jw",
    "rating": 8.5
  },
  {
    "description": "Авторитетный взгляд на историю культового электронного стиля глазами самых известных его представителей и последователей. Увлекательный рассказ о феномене итало-диско и возможность увидеть своими глазами, что творилось на главных танцполах 80-х.",
    "year": 2017,
    "id": 10,
    "title": "Наследие итало-диско",
    "genre_id": 9,
    "director_id": 9,
    "trailer": "https://www.youtube.com/watch?v=LVdRR6m5OdQ",
    "rating": 0
  },
  {
    "description": "Юность певца Джонни Кэша была омрачена гибелью его брата и пренебрежительным отношением отца. Военную службу будущий певец проходил в Германии. После свадьбы и рождения дочери он выпустил свой первый хит и вскоре отправился в турне по США вместе с Джерри Ли Льюисом, Элвисом Пресли и Джун Картер, о которой он безнадёжно мечтал целых десять лет.",
    "year": 2005,
    "id": 11,
    "title": "Переступить черту",
    "genre_id": 4,
    "director_id": 10,
    "trailer": "https://www.youtube.com/watch?v=RnFrrzg1OEQ",
    "rating": 7.8
  },
  {
    "description": "Наследник знаменитого дома Атрейдесов Пол отправляется вместе с семьей на одну из самых опасных планет во Вселенной — Арракис. Здесь нет ничего, кроме песка, палящего солнца, гигантских чудовищ и основной причины межгалактических конфликтов — невероятно ценного ресурса, который называется меланж. В результате захвата власти Пол вынужден бежать и скрываться, и это становится началом его эпического путешествия. Враждебный мир Арракиса приготовил для него множество тяжелых испытаний, но только тот, кто готов взглянуть в глаза своему страху, достоин стать избранным.",
    "year": 2021,
    "id": 12,
    "title": "Дюна",
    "genre_id": 7,
    "director_id": 11,
    "trailer": "https://www.youtube.com/watch?v=DOlTmIhEsg0",
    "rating": 8.4
  },
  {
    "description": "Это история любви старлетки, которая между прослушиваниями подает кофе состоявшимся кинозвездам, и фанатичного джазового музыканта, вынужденного подрабатывать в заштатных барах. Но пришедший к влюбленным успех начинает подтачивать их отношения.",
    "year": 2016,
    "id": 13,
    "title": "Ла-Ла Ленд",
    "genre_id": 18,
    "director_id": 8,
    "trailer": "https://www.youtube.com/watch?v=lneNCBIXD4I",
    "rating": 8
  },
  {
    "description": "Рассказ о начале творческого пути Виктора Цоя и группы «Кино», о его взаимоотношениях с Майком Науменко, его женой Натальей и многими, кто был в авангарде рок-движения Ленинграда 1981 года.",
    "year": 2018,
    "id": 14,
    "title": "Лето",
    "genre_id": 4,
    "director_id": 12,
    "trailer": "https://www.youtube.com/watch?v=TvAbtsQKrHA",
    "rating": 7.3
  },
  {
    "description": "Джек Торренс с женой и сыном приезжает в элегантный отдалённый отель, чтобы работать смотрителем во время мертвого сезона. Торренс здесь раньше никогда не бывал. Или это не совсем так? Ответ лежит во мраке, сотканном из преступного кошмара.",
    "year": 1980,
    "id": 15,
    "title": "Сияние ",
    "genre_id": 6,
    "director_id": 14,
    "trailer": "https://www.youtube.com/watch?v=NMSUEhDWXH0",
    "rating": 8.4
  },
  {
    "description": "Что если в один прекрасный день в тебя вселяется существо-симбиот, которое наделяет тебя сверхчеловеческими способностями? Вот только Веном – симбиот совсем недобрый, и договориться с ним невозможно. Хотя нужно ли договариваться?.. Ведь в какой-то момент ты понимаешь, что быть плохим вовсе не так уж и плохо. Так даже веселее. В мире и так слишком много супергероев! Мы – Веном!",
    "year": 2018,
    "id": 16,
    "title": "Веном",
    "genre_id": 7,
    "director_id": 13,
    "trailer": "https://www.youtube.com/watch?v=n7GlLxV_Igk",
    "rating": 6.7
  },
  {
    "description": "К своим 16 годам старшеклассник Донни уже знает, что такое смерть. После несчастного случая, едва не стоившего ему жизни, Донни открывает в себе способности изменять время и судьбу. Произошедшие с ним перемены пугают его окружение — родителей, сестер, учителей, друзей и любимую девушку.",
    "year": 2001,
    "id": 17,
    "title": "Донни Дарко",
    "genre_id": 7,
    "director_id": 15,
    "trailer": "https://www.youtube.com/watch?v=9H_t5cdszFU",
    "rating": 8
  },
  {
    "description": "Уже немолодой школьный учитель музыки Джо Гарднер всю жизнь мечтал выступать на сцене в составе джазового ансамбля. Однажды он успешно проходит прослушивание у легендарной саксофонистки и, возвращаясь домой вне себя от счастья, падает в люк и умирает. Теперь у Джо одна дорога — в Великое После, но он сбегает с идущего в вечность эскалатора и случайно попадает в Великое До. Тут новенькие души обретают себя, и у будущих людей зарождаются увлечения, мечты и интересы. Джо становится наставником упрямой души 22, которая уже много веков не может найти свою искру и отправиться на Землю.",
    "year": 2020,
    "id": 18,
    "title": "Душа",
    "genre_id": 16,
    "director_id": 16,
    "trailer": "https://www.youtube.com/watch?v=vsb8762mE6Q",
    "rating": 8.1
  },
  {
    "description": "Париж. 1910 год. Ужасный монстр, напоминающий гигантское насекомое, нагоняет страх на всю Францию. Застенчивый киномеханик и неутомимый изобретатель начинают охоту на него. В этой погоне они знакомятся со звездой кабаре, сумасшедшим ученым и его умной обезьянкой и, наконец, самим монстром, который оказывается совсем не страшным. Теперь безобидное, как блоха, чудовище ищет у своих новых друзей защиты от вредного начальника городской полиции.",
    "year": 2010,
    "id": 19,
    "title": "Монстр в Париже",
    "genre_id": 16,
    "director_id": 18,
    "trailer": "https://www.youtube.com/watch?v=rKsdTuvrF5w",
    "rating": 6.1
  },
  {
    "description": "От Великого потопа зверей спас ковчег. Но спустя полгода скитаний они готовы сбежать с него куда угодно. Нервы на пределе. Хищники готовы забыть про запреты и заглядываются на травоядных. Единственное спасение — найти райский остров. Там простор и полно еды. Но даже если он совсем близко, будут ли рады местные такому количеству гостей?",
    "year": 2020,
    "id": 20,
    "title": "Упс... Приплыли!",
    "genre_id": 16,
    "director_id": 19,
    "trailer": "https://www.youtube.com/watch?v=Qjpmysz4x-4",
    "rating": 5.9
  }
]

genres = [
  {
    "id": 1,
    "name": "Комедия"
  },
  {
    "id": 2,
    "name": "Семейный"
  },
  {
    "id": 3,
    "name": "Фэнтези"
  },
  {
    "id": 4,
    "name": "Драма"
  },
  {
    "id": 5,
    "name": "Приключения"
  },
  {
    "id": 6,
    "name": "Триллер"
  },
  {
    "id": 7,
    "name": "Фантастика"
  },
  {
    "id": 8,
    "name": "Аниме"
  },
  {
    "id": 9,
    "name": "Документальное"
  },
  {
    "id": 10,
    "name": "Короткометражка"
  },
  {
    "id": 11,
    "name": "Ужасы"
  },
  {
    "id": 12,
    "name": "Боевик"
  },
  {
    "id": 13,
    "name": "Мелодрама"
  },
  {
    "id": 14,
    "name": "Детектив"
  },
  {
    "id": 15,
    "name": "Авторское кино"
  },
  {
    "id": 16,
    "name": "Мультфильм"
  },
  {
    "id": 17,
    "name": "Вестерн"
  },
  {
    "id": 18,
    "name": "Мюзикл"
  }
]

directors = [
  {
    "id": 1,
    "name": "Тейлор Шеридан"
  },
  {
    "id": 2,
    "name": "Квентин Тарантино"
  },
  {
    "id": 3,
    "name": "Владимир Вайншток"
  },
  {
    "id": 4,
    "name": "Декстер Флетчер"
  },
  {
    "id": 5,
    "name": "Стив Энтин"
  },
  {
    "id": 6,
    "name": "Роб Маршалл"
  },
  {
    "id": 7,
    "name": "Баз Лурман"
  },
  {
    "id": 8,
    "name": "Дэмьен Шазелл"
  },
  {
    "id": 9,
    "name": "Пьетро Антон"
  },
  {
    "id": 10,
    "name": "Джеймс Мэнголд"
  },
  {
    "id": 11,
    "name": "Дени Вильнёв"
  },
  {
    "id": 12,
    "name": "Кирилл Серебренников"
  },
  {
    "id": 13,
    "name": "Рубен Фляйшер"
  },
  {
    "id": 14,
    "name": "Стэнли Кубрик"
  },
  {
    "id": 15,
    "name": "Ричард Келли"
  },
  {
    "id": 16,
    "name": "Пит Доктер"
  },
  {
    "id": 17,
    "name": "Кемп Пауэрс"
  },
  {
    "id": 18,
    "name": "Бибо Бержерон"
  },
  {
    "id": 19,
    "name": "Тоби Генкель"
  },
  {
    "id": 20,
    "name": "Шон Маккормак"
  }
]


def load_test_data():
    db.create_all()
    for movie in movies:

        m = Movie(
          id=movie['id'],
          title=movie['title'],
          description=movie['description'],
          trailer=movie['trailer'],
          year=movie['year'],
          rating=movie['rating'],
          genre_id=movie['genre_id'],
          director_id=movie['director_id'],
        )
        db.session.add(m)
        db.session.commit()

    for genre in genres:
      g = Genre(
        id=genre['id'],
        name=genre['name']
      )
      db.session.add(g)
      db.session.commit()

    for director in directors:
      d = Director(
        id=director['id'],
        name=director['name']
      )
      db.session.add(d)
      db.session.commit()
